In [1]:
import pandas as pd

In [6]:
friend_list = [
                ['name', ['John','Jenny','Nate']],
                ['age',[20, 30, 25]],
                ['job', ['student', 'developer','teacher']]
                ]
df = pd.DataFrame.from_dict(dict(friend_list))

In [7]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   25    teacher

In [8]:
df[1:3] #1번과 2번만 보여줌, 마지막인덱스-1까지 포함

    name  age        job
1  Jenny   30  developer
2   Nate   25    teacher

In [9]:
df #원래df가 수정되는것은 아님

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   25    teacher

In [10]:
df = df[1:3] #수정

In [11]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   25    teacher

In [12]:
friend_list = [
                ['name', ['John','Jenny','Nate']],
                ['age',[20, 30, 25]],
                ['job', ['student', 'developer','teacher']]
                ]
df = pd.DataFrame.from_dict(dict(friend_list))

In [13]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   25    teacher